#### 创建 DataFrame

In [1]:
import pandas as pd
data = pd.read_csv('credit_card_dataset.csv')
print(len(data))
print(data.iloc[0][0:3])

30000
id               2
LIMIT_BAL    20000
SEX              2
Name: 0, dtype: int64

In [2]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df.iloc[0:300]

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

#### 列顺序调整

In [3]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df[['Age','Name','Name']]

   Age    Name    Name
0   10    Alex    Alex
1   12     Bob     Bob
2   13  Clarke  Clarke

#### 按条件筛选行

In [4]:
a = df.loc[df['Name'] != 'Bob']
print(a)
print(type(a))

     Name  Age
0    Alex   10
2  Clarke   13
<class 'pandas.core.frame.DataFrame'>

#### 取前几行查看

In [5]:
df.head(n=1)

   Name  Age
0  Alex   10

#### DataFrame 赋值

In [16]:
df.loc[df['Name'] == 'Bob', 'Age'] = 14
df

     Name  Age
0    Alex   10
1     Bob   14
2  Clarke   13

#### DataFrame 多列赋值

In [18]:
df.loc[df['Name'] == 'Bob', ['Age', 'Name']] = [15, 'Bobb']
df

     Name  Age
0    Alex   10
1    Bobb   15
2  Clarke   13